EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
//    All rights reserved.
//
//    Permission to use, copy, modify, and distribute this software and its
//    documentation for any purpose, without fee, and without written agreement is
//    hereby granted, provided that the above copyright notice, the following
//    two paragraphs and the authors appear in all copies of this software.
//
//    IN NO EVENT SHALL THE "AUTHORS" BE LIABLE TO ANY PARTY FOR
//    DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT
//    OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN IF THE "AUTHORS"
//    HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//    THE "AUTHORS" SPECIFICALLY DISCLAIMS ANY WARRANTIES,
//    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
//    AND FITNESS FOR A PARTICULAR PURPOSE.  THE SOFTWARE PROVIDED HEREUNDER IS
//    ON AN "AS IS" BASIS, AND THE "AUTHORS" HAS NO OBLIGATION TO
//    PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS."
//
//    Please maintain this header in its entirety when copying/modifying
//    these files.
//
// *********************************************
// Truck_App2.c
// *********************************************

/*
can't call ESOS_TASK_WAIT_TICKS from within mail recipient?

note: don't do any assignment statements before ESOS_TASK_BEGIN()
it causes strange side-effects
*/

#if 1
#if 1
#ifdef BUILT_ON_ESOS
#warning "BUILT_ON_ESOS defined"
#else
#warning "BUILT_ON_ESOS not defined"
#endif

#include "../esos/include/esos.h"
#include "../lib/include/pic24_ports_config.h"
#include "../lib/include/pic24_ports_mapping.h"
#include "../lib/include/pic24_libconfig.h"
#include "../esos/include/pic24/esos_pic24.h"
#include "../esos/include/pic24/esos_pic24_rs232.h"
#include "../esos/include/pic24/esos_pic24_spi.h"
#include "../lib/include/pic24_all.h"
#include "../lib/include/pic24_timer.h"
#include "../lib/include/pic24_util.h"
#include "../lib/include/pic24_adc.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "../../mytypes.h"
#include "raw_data.h"

ESOS_SEMAPHORE(key_sem);
ESOS_SEMAPHORE(lcd_sem);
ESOS_USER_TASK(keypad);
ESOS_USER_TASK(poll_keypad);
//ESOS_USER_TASK(spi_task);
ESOS_USER_TASK(AVR_cmd);
ESOS_USER_TASK(main_proc);
ESOS_USER_TASK(send_fpga);
ESOS_USER_TASK(recv_lcd);
ESOS_USER_TASK(send_comm1);
ESOS_USER_TASK(recv_comm1);
ESOS_USER_TASK(process_comm1);
ESOS_USER_TASK(menu_task);
ESOS_USER_TASK(password_task);
ESOS_USER_TASK(numentry_task);
ESOS_USER_TASK(display_rtlabels);
ESOS_USER_TASK(key_timer_task);
ESOS_USER_TASK(temp_monitor_task);
ESOS_USER_TASK(display_rtvalues);

static UCHAR avr_buffer[20];
static ESOS_TASK_HANDLE avr_handle;
static ESOS_TASK_HANDLE fpga_handle;
static ESOS_TASK_HANDLE recv_handle;

#define AVR_CALL() __esos_CB_WriteUINT8Buffer(avr_handle->pst_Mailbox->pst_CBuffer, &avr_buffer[0], AVR_BUF_LEN);

#define MY_ESOS1

#define TDELAY 2
#define TDELAY2 1
#define VREF 3.3  //assume Vref = 3.3 volts
#define FLAG1	ESOS_USER_FLAG_1
#define PASSWORD_RETRIES_NUM 5

// handshaking lines to FPGA
#define DataReady _LATG14		// output
#define CmdParam _LATG12		// output
#define DataSent _RG13			// input

enum rt_values_offsets
{
	OIL_PRES,
	AIR_TEMP,
	MAP,
	OIL_TEMP,
	O2,
	ODOM,
	TRIP,
	RPM,
	MPH,
	RUN_TIME,
	ENG_TEMP,
	OUTDOOR_TEMP,
	INDOOR_TEMP
} RT_VALUES_OFFSETS_TYPES;

enum key_types
{
	KP_1 = 0xE0, // '1'		- E0
	KP_2, // '2'		- E1
	KP_3, // '3'		- E2
	KP_4, // '4'		- E3
	KP_5, // '5'		- E4
	KP_6, // '6'		- E5
	KP_7, // '7'		- E6
	KP_8, // '8'		- E7
	KP_9, // '9'		- E8
	KP_A, // 'A'		- E9
	KP_B, // 'B'		- EA
	KP_C, // 'C'		- EB
	KP_D, // 'D'		- EC
	KP_POUND,	// '#'	- ED
	KP_AST, // '*'		- EE
	KP_0 	// '0'		- EF
} KEY_TYPES;

typedef struct
{
	UCHAR row;
	UCHAR col;
	UCHAR data_col;
	UCHAR str;
} FORMAT_STR;

static FORMAT_STR rtlabel_str[NUM_RT_LABELS];
static FORMAT_STR status_label_str[NUM_STATUS_LABELS];

volatile UCHAR menu_ptr;

#define ROWS 16
#define COLUMN 40
#define DISPLAY_OFF         0x90    //0b10010000, display off
#define CURSOR_ON_BLINK_OFF 0x92    //0b1001xx10, cursor on without blinking
#define CURSOR_BLINK_ON     0x93    //0b1001xx11, cursor on with blinking
#define TEXT_ON             0x94    //0b100101xx, text on, graphics off
#define GRAPHIC_ON          0x98    //0b100110xx, text off, graphics on
#define TEXT_GRH_ON         0x9C    //0b100111xx, text on, graphics on
#define ATTR_NORMAL         0x00    //Normal Display
#define ATTR_REVERSE        0x05    
//Reverse Di../t6963.h:189:33: error: expected ';', ',' or ')' before 'mode'splay
#define ATTR_INHIBIT        0x03    //Inhibit Display
#define ATTR_BLINK          0x08    //Blinking of Normal Display
#define ATTR_BLINK_REVERSE  0x0D    //Blinking of Reverse Display
#define ATTR_BLINK_INHIBIT  0x0B    //Blinking of Inhibit Display
#define LINE_8_CURSOR       0xA7    //8-line cursor mode
#define LINE_7_CURSOR       0xA6    //7-line cursor mode
#define LINE_6_CURSOR       0xA5    //6-line cursor mode
#define LINE_5_CURSOR       0xA4    //5-line cursor mode
#define LINE_4_CURSOR       0xA3    //4-line cursor mode
#define LINE_3_CURSOR       0xA2    //3-Line cursor mode
#define LINE_2_CURSOR       0xA1    //2-Line cursor mode
#define LINE_1_CURSOR       0xA0    //1-Line cursor mode

// commands for RPM/MPH LED display
#define RPM_SEND_CHAR_CMD 			0x01
#define MPH_SEND_CHAR_CMD 			0x02

#define RPM_OFF_CMD 				0x04
#define RPM_SET_BRIGHTNESS_CMD 		0x05
#define RPM_SET_CDECIMAL_CMD 		0x06
#define RPM_SET_UPDATE_RATE_CMD 	0x07
#define RPM_SET_FACTOR_CMD 			0x08
#define RPM_SET_FACTORY_RESET		0x09

#define MPH_OFF_CMD 				0x0A
#define MPH_SET_BRIGHTNESS_CMD 		0x0C
#define MPH_SET_CDECIMAL_CMD 		0x0D
#define MPH_SET_UPDATE_RATE_CMD 	0x0E
#define MPH_SET_FACTOR_CMD 			0x0F
#define MPH_SET_FACTORY_RESET		0x10

// other FPGA commands
#define SET_FPGA_SEND_UPDATE_RATE 	0x20
#define DTMF_TONE_ON 				0x21
#define DTMF_TONE_OFF 				0x22
#define SPECIAL_TONE_ON 			0x23
#define LCD_PWM 					0x24
#define FP_SHUTOFF_OVERRIDE 		0x25
#define SET_MAX_REV_LIMITER 		0x26
#define SET_MIN_REV_LIMITER 		0x27
#define TEST_RPM_LIMIT 				0x28
#define TEST_COMM					0x29

#define PWM_OFF_PARAM					0x01 // off
#define PWM_ON_PARAM					0x1F // on
#define PWM_80DC_PARAM					0x1A // duty_cycle = 80%
#define PWM_75DC_PARAM					0x16 // duty_cycle = 75%
#define PWM_60DC_PARAM					0x12 // duty_cycle = 60%
#define PWM_50DC_PARAM					0x0E // duty_cycle = square wave
#define PWM_30DC_PARAM					0x0A // duty_cycle = 30%
#define PWM_25DC_PARAM					0x06 // duty_cycle = 25%
#define PWM_12DC_PARAM					0x02 // duty_cycle = 12%

static uint16_t au16_buffer[NUM_ADC_CHANNELS];
static UCHAR u8_pot[NUM_ADC_CHANNELS];
uint8_t  u8_waiting;
int lat5;
static int key_enter_time;
static char password[PASSWORD_SIZE];
static char correct_password[PASSWORD_SIZE];
static UCHAR password_valid;
static int password_ptr;
static int password_retries;
static int dim_screen;
static int silent_key;
static UINT gl_rpm, gl_mph;
static UINT gl_engine_temp, gl_indoor_temp, gl_outdoor_temp, gl_temp4;
static UINT gl_blower_en, gl_fan_on, gl_fan_off, gl_blower1_on, gl_blower2_on, gl_blower3_on;
static int engine_run_time;
static int engine_on;
static int engine_shutdown;
static int engine_shuttingdown;
static char num_entry_num[SIZE_NUM];
static int num_entry_ptr;
static int num_entry_limit;
static int num_entry_type;
static UINT curr_num_entry_row;
static UINT curr_num_entry_col;
//static void init_menu_labels(void);
static void init_rtlabels(void);
static char *temp_lookup(int raw);
static int lights_on;
static int brights_on;
static int fan_on;
static int blower_on;
//static int convertF(int raw_data);

