EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
typedef enum
{
	NORMAL,
	PASSWORD,
	NUMENTRY,
}KEY_MODE;

KEY_MODE key_mode;

#endif
//******************************************************************************************//
//*************************************** menu_task ****************************************//
//******************************************************************************************//
ESOS_USER_TASK(menu_task)
{
	static UCHAR data1;
	static UINT data4;
    static ESOS_TASK_HANDLE rt_handle;
	static ESOS_TASK_HANDLE comm1_handle;
	static int screen_dim;
	static UCHAR screen_dim_array[9];
	static int screen_dim_ptr;
	static int i;
	static char raw_str[10];
	
    ESOS_TASK_BEGIN();

	rt_handle = esos_GetTaskHandle(display_rtlabels);

	comm1_handle = esos_GetTaskHandle(send_comm1);
	screen_dim = 0;

	screen_dim_array[0] =  PWM_ON_PARAM;
	screen_dim_array[1] =  PWM_80DC_PARAM;
	screen_dim_array[2] =  PWM_75DC_PARAM;
	screen_dim_array[3] =  PWM_60DC_PARAM;
	screen_dim_array[4] =  PWM_50DC_PARAM;
	screen_dim_array[5] =  PWM_30DC_PARAM;
	screen_dim_array[6] =  PWM_25DC_PARAM;
	screen_dim_array[7] =  PWM_12DC_PARAM;
	screen_dim_array[8] =  PWM_OFF_PARAM;
	screen_dim_ptr = 0;
	lights_on = -1;
	fan_on = 0;
	blower_on = 0;
	brights_on = 0;

	while (TRUE)
	{
		ESOS_TASK_WAIT_FOR_MAIL();

		while(ESOS_TASK_IVE_GOT_MAIL())
		{
			data1 = __esos_CB_ReadUINT8(__pstSelf->pst_Mailbox->pst_CBuffer);
/*
			avr_buffer[0] = SEND_BYTE_RT_VALUES;
			avr_buffer[1] = 1;
			avr_buffer[2] = 0;
			avr_buffer[3] = data1 - KP_1;
			AVR_CALL();
*/
			switch(data1)
			{
				case 	KP_1:	// start engine
					switch(menu_ptr)
					{
						case 0:
							if(engine_on == 0)
							{
								__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,START_SEQ);
								engine_on = 1;
							}
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case 	KP_2:	// shutoff engine
					switch(menu_ptr)
					{
						case 0:
							__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,SHUTDOWN);
							engine_on = 0;
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_3:	// toggle brights
					switch(menu_ptr)
					{
						case 0:
							if(lights_on > 0)
							{
								if(brights_on == 0)
								{
									__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,ON_BRIGHTS);
									brights_on = 1;
								}
								else
								{
									__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,OFF_BRIGHTS);
									brights_on = 0;
								}
							}
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_4:	// toggle cooling fan
					switch(menu_ptr)
					{
						case 0:
							if(fan_on == 0)
							{
								__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,ON_FAN);
								fan_on = 1;
							}
							else
							{
								__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,OFF_FAN);
								fan_on = 0;
							}
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_5:	// turn heater blower on
					switch(menu_ptr)
					{
						case 0:
							if(blower_on == 1)
							{
								__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,BLOWER_OFF);
								blower_on = 0;
							}else
							{
								__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,BLOWER3);
								blower_on = 1;
							}
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_6:		// dim the screen
					switch(menu_ptr)
					{
						case 0:
							data4 = LCD_PWM;
							data4 <<= 8;
							data4 &= 0xFF00;
							data4 |= screen_dim_array[screen_dim_ptr];
							__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data4);
							if(++screen_dim_ptr > 8)
								screen_dim_ptr = 0;
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_7:		// toggle lights
					switch(menu_ptr)
					{
						case 0:	// toggle lights
							if(lights_on < 10)
							{
								__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,ON_LIGHTS);
								lights_on = 120;
							}
							else
							{
								__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,
									OFF_LIGHTS);
								lights_on = -1;
								if(brights_on == 1)
								{
									__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,OFF_BRIGHTS);
									brights_on = 0;
								}

							}
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_8:		// numeric entry
/*
					avr_buffer[4] = 0x41;
					avr_buffer[5] = 0x42;
					avr_buffer[6] = 0x43;
					avr_buffer[7] = 0x44;
					avr_buffer[8] = 0;

					strncpy((char *)&avr_buffer[3],raw_str,9);
					AVR_CALL();

					avr_buffer[0] = SEND_BYTE_RT_VALUES;
					avr_buffer[1] = 3;
					avr_buffer[2] = 15;
					avr_buffer[3] = (UCHAR)(test << 8);
					AVR_CALL();
					avr_buffer[0] = SEND_BYTE_RT_VALUES;
					avr_buffer[1] = 4;
					avr_buffer[2] = 15;
					avr_buffer[3] = (UCHAR)test;
					AVR_CALL();
*/

					switch(menu_ptr)
					{

						case 0:	// set time & date - use numentry and enter as: MMDDYYHHMM
/*
							curr_num_entry_row = 7;
							curr_num_entry_col = 0;
							avr_buffer[0] = GOTO_CMD;
							avr_buffer[1] = (UCHAR)curr_num_entry_row;
							avr_buffer[2] = (UCHAR)curr_num_entry_col;
							AVR_CALL();
							key_mode = NUMENTRY;
							num_entry_type = TIME_DATE;
							num_entry_limit = 1;
*/
						break;
						case 1:
						break;
						default:
						break;
					}

				break;

				case	KP_9:
					switch(menu_ptr)
					{
						case 0:
							__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,SPECIAL_CMD);
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_POUND:

					switch(menu_ptr)
					{
						case 0:
/*
							avr_buffer[0] = SEND_INT_RT_VALUES;
							avr_buffer[1] = 0;
							avr_buffer[2] = 0;
							avr_buffer[3] = (UCHAR)(gl_fan_on >> 8);
							avr_buffer[4] = (UCHAR)gl_fan_on;
							AVR_CALL();

							avr_buffer[0] = SEND_INT_RT_VALUES;
							avr_buffer[1] = 0;
							avr_buffer[2] = 6;
							avr_buffer[3] = (UCHAR)(gl_fan_off >> 8);
							avr_buffer[4] = (UCHAR)gl_fan_off;
							AVR_CALL();

							avr_buffer[0] = SEND_INT_RT_VALUES;
							avr_buffer[1] = 0;
							avr_buffer[2] = 12;
							avr_buffer[3] = (UCHAR)(gl_blower_en >> 8);
							avr_buffer[4] = (UCHAR)gl_blower_en;
							AVR_CALL();

							avr_buffer[0] = SEND_INT_RT_VALUES;
							avr_buffer[1] = 1;
							avr_buffer[2] = 0;
							avr_buffer[3] = (UCHAR)(gl_blower1_on >> 8);
							avr_buffer[4] = (UCHAR)gl_blower1_on;
							AVR_CALL();

							avr_buffer[0] = SEND_INT_RT_VALUES;
							avr_buffer[1] = 1;
							avr_buffer[2] = 6;
							avr_buffer[3] = (UCHAR)(gl_blower2_on >> 8);
							avr_buffer[4] = (UCHAR)gl_blower2_on;
							AVR_CALL();

							avr_buffer[0] = SEND_INT_RT_VALUES;
							avr_buffer[1] = 0;
							avr_buffer[2] = 12;
							avr_buffer[3] = (UCHAR)(gl_blower3_on >> 8);
							avr_buffer[4] = (UCHAR)gl_blower3_on;
							AVR_CALL();
*/
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_AST:
					switch(menu_ptr)
					{
						case 0:
							if(ESOS_IS_TASK_SLEEPING(recv_handle))
								ESOS_WAKE_TASK(recv_handle);
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_0:
					switch(menu_ptr)
					{
						case 0:
						break;
						case 1:
						break;
						default:
						break;
					}
				break;

				case	KP_A:		// change menu
				break;

				case	KP_B:		// toggle screen brightness
/*
					data4 = LCD_PWM;
					data4 <<= 8;
					data4 &= 0xFF00;
					if(screen_dim == 1)
						data4 |= PWM_12DC_PARAM;
					else data4 |= PWM_ON_PARAM;
					__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data4);
					screen_dim = (screen_dim == 1?0:1);
*/
				break;

