EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
				case	KP_C:		// toggle keypress tones
					silent_key = (silent_key == 1?0:1);
				break;

				case	KP_D:
					avr_buffer[0] = LCD_CLRSCR;
					avr_buffer[1] = 0;
					AVR_CALL();
					__esos_CB_WriteUINT8(rt_handle->pst_Mailbox->pst_CBuffer,data1);
				break;


				default:
				break;
			}
		}
	}
    ESOS_TASK_END();
}

//******************************************************************************************//
//************************************* password_task **************************************//
//******************************************************************************************//
ESOS_TASK_HANDLE password_task_handle;

ESOS_USER_TASK(password_task)
{
	static UCHAR data1, temp;
//	static ESOS_TASK_HANDLE comm1_handle;
    static ESOS_TASK_HANDLE rt_handle;

    ESOS_TASK_BEGIN();

    password_task_handle = ESOS_TASK_GET_TASK_HANDLE();
//	comm1_handle = esos_GetTaskHandle(send_comm1);
	rt_handle = esos_GetTaskHandle(display_rtlabels);
    
	ESOS_TASK_WAIT_TICKS(100);

	temp = 0;
	while (TRUE)
	{
		ESOS_TASK_WAIT_FOR_MAIL();

		while(ESOS_TASK_IVE_GOT_MAIL())
		{
			data1 = __esos_CB_ReadUINT8(__pstSelf->pst_Mailbox->pst_CBuffer);
			switch(data1)
			{
				case	KP_0:
				case 	KP_1:
				case	KP_2:
				case	KP_3:
				case	KP_4:
				case	KP_5:
				case	KP_6:
				case	KP_7:
				case	KP_8:
				case	KP_9:
					data1 = data1 - KP_1 + 0x31;
					password[password_ptr] = data1;
					avr_buffer[0] = CHAR_CMD;
					avr_buffer[1] = '*';
					AVR_CALL();

					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = 7;
					avr_buffer[3] = password_ptr+1;
					avr_buffer[4] = (LINE_1_CURSOR);
					AVR_CALL();

				break;

				case	KP_A:
					break;

				// backspace over current password
				case	KP_B:
					password_ptr--;
					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = 7;
					avr_buffer[3] = password_ptr;
					avr_buffer[4] = (LINE_1_CURSOR);
					AVR_CALL();
					break;

				case	KP_C:
				case	KP_D:
				case	KP_POUND:
				case	KP_AST:
				break;
				
				default:
				temp = 2;
				break;
			}

			// if password incorrect

			if(password[password_ptr] != correct_password[password_ptr])
			{

				// if incorrect password, first display "bad password" message
				avr_buffer[0] = LCD_CLRSCR;
				avr_buffer[1] = 0;
				AVR_CALL();

				avr_buffer[0] = EEPROM_STR;
				avr_buffer[1] = 5;
				avr_buffer[2] = 0;
				avr_buffer[3] = VARIOUS_MSG_OFFSET + 1;	// "bad password"
				avr_buffer[4] = 1;
				AVR_CALL();

				avr_buffer[0] = EEPROM_STR;
				avr_buffer[1] = 6;	// row 7
				avr_buffer[2] = 0;	// col 0
				avr_buffer[3] =  VARIOUS_MSG_OFFSET;	// ("enter password")
				avr_buffer[4] = 1;
				AVR_CALL();

				avr_buffer[0] = SET_MODE_CMD;
				avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
				avr_buffer[2] = 7;
				avr_buffer[3] = 0;
				avr_buffer[4] = (LINE_1_CURSOR);
				AVR_CALL();
				memset(password,0,PASSWORD_SIZE);
				password_ptr = -1;
				password_retries++;
			}else if(password_ptr == strlen(correct_password) - 1)
			{
				memset(password,0,PASSWORD_SIZE);
				password_ptr = -1;
				avr_buffer[0] = LCD_CLRSCR;
				avr_buffer[1] = 0;
				AVR_CALL();

				__esos_CB_WriteUINT8(rt_handle->pst_Mailbox->pst_CBuffer,data1);
				key_mode = NORMAL;
				engine_shuttingdown = 0;
			}
			
			password_ptr++;
			if(password_ptr > PASSWORD_SIZE)
				password_ptr = 0;

		}		// end of mail
	}	// end of 'while(TRUE)'
    ESOS_TASK_END();
}

//******************************************************************************************//
//************************************* numentry_task **************************************//
//******************************************************************************************//
ESOS_USER_TASK(numentry_task)
{
	static UCHAR data1;
	static int i;
	
    ESOS_TASK_BEGIN();
	memset(num_entry_num,0,SIZE_NUM);
	num_entry_ptr = 0;
	num_entry_limit = 0;
	
	while (TRUE)
	{
		ESOS_TASK_WAIT_FOR_MAIL();

		while(ESOS_TASK_IVE_GOT_MAIL())
		{
			data1 = __esos_CB_ReadUINT8(__pstSelf->pst_Mailbox->pst_CBuffer);

			switch(data1)
			{
				case 	KP_1:
				case	KP_2:
				case	KP_3:
				case	KP_4:
				case	KP_5:
				case	KP_6:
				case	KP_7:
				case	KP_8:
				case	KP_9:
				case	KP_0:
					if(data1 == KP_0)
						data1 = data1 - KP_0;
					else	
						data1 = data1 - KP_1 + 1;
					num_entry_num[num_entry_ptr++] = data1;
					if(num_entry_ptr > num_entry_limit)
					{
						num_entry_ptr = num_entry_limit;
					}
					avr_buffer[0] = CHAR_CMD;
					avr_buffer[1] = data1 + 0x30;
					AVR_CALL();
					curr_num_entry_col++;

					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = curr_num_entry_row;
					avr_buffer[3] = curr_num_entry_col;
					avr_buffer[4] = (LINE_1_CURSOR);
					AVR_CALL();
				break;

				// 'backspace'
				case	KP_B:
					avr_buffer[0] = GOTO_CMD;
					avr_buffer[1] = curr_num_entry_row;
					avr_buffer[2] = --curr_num_entry_col;
					AVR_CALL();
					avr_buffer[0] = CHAR_CMD;
					avr_buffer[1] = 0x20;
					AVR_CALL();
					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = curr_num_entry_row;
					avr_buffer[3] = curr_num_entry_col;
					avr_buffer[4] = (LINE_1_CURSOR);
					AVR_CALL();
					
					if(--num_entry_ptr < 0)
						num_entry_ptr = 0;
				break;
				// clear entry and start over
				case	KP_A:
				case	KP_C:
					curr_num_entry_col -= num_entry_ptr;
					avr_buffer[0] = GOTO_CMD;
					avr_buffer[1] = curr_num_entry_row;
					avr_buffer[2] = curr_num_entry_col;
					AVR_CALL();
					for(i = 0;i < num_entry_ptr;i++)
					{
						avr_buffer[0] = CHAR_CMD;
						avr_buffer[1] = 0x20;
						AVR_CALL();
					}
					avr_buffer[0] = GOTO_CMD;
					avr_buffer[1] = curr_num_entry_row;
					avr_buffer[2] = curr_num_entry_col;
					AVR_CALL();
					avr_buffer[0] = SET_MODE_CMD;
					avr_buffer[1] = TEXT_ON | CURSOR_BLINK_ON;
					avr_buffer[2] = curr_num_entry_row;
					avr_buffer[3] = curr_num_entry_col;
					avr_buffer[4] = (LINE_1_CURSOR);
					AVR_CALL();

