EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
					if(data1 == KP_A)
					{
						avr_buffer[0] = GOTO_CMD;
						avr_buffer[1] = 0;
						avr_buffer[2] = 0;
						AVR_CALL();

						avr_buffer[0] = CHAR_CMD;
						for(i = 0;i < num_entry_ptr;i++)
						{
							avr_buffer[1] = num_entry_num[i] + 0x30;
							AVR_CALL();
						}
						key_mode = NORMAL;
						// now do something with the number just entered in num_entry_num
						switch(num_entry_type)
						{
							case TIME_DATE:
							break;
							case TIME_ENG_OFF:
							break;
							case FPGA_SEND_RATE:
							break;
							case RPM_MPH_UPDATE_RATE:
							break;
							case HIGH_REV_LIMIT:
							break;
							case LOW_REV_LIMIT:
							break;
							case SET_LIGHTS_OFF:
							break;
							case CHANGE_PASSWORD:
							break;
							default:
							break;
						}
					}
					memset(num_entry_num,0,SIZE_NUM);
					num_entry_ptr = 0;

				break;
				case	KP_D:
					num_entry_ptr = 0;
					memset(num_entry_num,0,SIZE_NUM);
					key_mode = NORMAL;
				break;
				case	KP_POUND:
				break;
				case	KP_AST:
				break;
				default:
				break;
			}
		}
	}
    ESOS_TASK_END();
}

/*
RE0 - p93 - 5th from right inside top			//	row 0
RE1 - p94 - 4th from right outside top			//	row 1
RE2 - p98 - 2nd from right outside top			//	row 2
RE3 - p99 - 2nd from right inside top			//	row 3

RA0 - p17 - 5th up - outside right				//	col 0
RA1 - p38 - 7th from right - outside bottom		//	col 1
RA2 - p58 - 4th up from bottom - inside left	//	col 2
RA3 - p59 - 5th up from bottom - outside left	//	col 3
*/

#define C0 _RA0
#define C1 _RA1
#define C2 _RA2
#define C3 _RA3

// test

static inline void CONFIG_COLUMN()
{
	CONFIG_RA0_AS_DIG_INPUT();
	ENABLE_RA0_PULLUP();
	CONFIG_RA1_AS_DIG_INPUT();
	ENABLE_RA1_PULLUP();
	CONFIG_RA2_AS_DIG_INPUT();
	ENABLE_RA2_PULLUP();
	CONFIG_RA3_AS_DIG_INPUT();
	ENABLE_RA3_PULLUP();
}

#define R0 _LATE0
#define R1 _LATE1
#define R2 _LATE2
#define R3 _LATE3

#define CONFIG_R0_DIG_OUTPUT() CONFIG_RE0_AS_DIG_OUTPUT()
#define CONFIG_R1_DIG_OUTPUT() CONFIG_RE1_AS_DIG_OUTPUT()
#define CONFIG_R2_DIG_OUTPUT() CONFIG_RE2_AS_DIG_OUTPUT()
#define CONFIG_R3_DIG_OUTPUT() CONFIG_RE3_AS_DIG_OUTPUT()

void CONFIG_ROW()
{
	CONFIG_R0_DIG_OUTPUT();
	CONFIG_R1_DIG_OUTPUT();
	CONFIG_R2_DIG_OUTPUT();
	CONFIG_R3_DIG_OUTPUT();
}

static inline void DRIVE_ROW_LOW()
{
	R0 = 0;
	R1 = 0;
	R2 = 0;
	R3 = 0;
}

static inline void DRIVE_ROW_HIGH()
{
	R0 = 1;
	R1 = 1;
	R2 = 1;
	R3 = 1;
}

typedef enum
{
	STATE_WAIT_FOR_PRESS = 0x30,
	STATE_WAIT_FOR_PRESS2,
	STATE_WAIT_FOR_RELEASE
} ISRSTATE;

static ISRSTATE e_isrState;
static uint8_t u8_newKey = 0;

void configKeypad(void)
{
	CONFIG_ROW();
	DRIVE_ROW_LOW();
	CONFIG_COLUMN();
	DELAY_US(1);								  //wait for pullups to stabilize inputs
	e_isrState = STATE_WAIT_FOR_PRESS;
}

//drive one row low
void setOneRowLow(uint8_t u8_x)
{
	switch (u8_x)
	{
		case 0:
			R0 = 0;
			R1 = 1;
			R2 = 1;
			R3 = 1;
			break;
		case 1:
			R0 = 1;
			R1 = 0;
			R2 = 1;
			R3 = 1;
			break;
		case 2:
			R0 = 1;
			R1 = 1;
			R2 = 0;
			R3 = 1;
			break;
		default:
			R0 = 1;
			R1 = 1;
			R2 = 1;
			R3 = 0;
			break;
	}
}
#define NUM_ROWS 4
#define NUM_COLS 4
const uint8_t au8_keyTable[NUM_ROWS][NUM_COLS] =
{
	{KP_1, KP_2, KP_3, KP_A },
	{KP_4, KP_5, KP_6, KP_B },
	{KP_7, KP_8, KP_9, KP_C },
	{KP_AST, KP_0, KP_POUND, KP_D}
};
//	{'1', '2', '3', 'A'},
//	{'4', '5', '6', 'B'},
//	{'7', '8', '9', 'C'},
//	{'*', '0', '#', 'D'}

#define KEY_PRESSED() (!C0 || !C1 || !C2 || !C3)  //any low
#define KEY_RELEASED() (C0 && C1 && C2 && C3)	  //all high

uint8_t doKeyScan(void)
{
	uint8_t u8_row, u8_col;
//determine column
	if (!C0) u8_col = 0;
	else if (!C1) u8_col = 1;
	else if (!C2) u8_col = 2;
	else if (!C3) u8_col = 3;
	else return('E');							  //error
//determine row
	for (u8_row = 0; u8_row < NUM_ROWS; u8_row++)
	{
		setOneRowLow(u8_row);					  //enable one row low
		if (KEY_PRESSED())
		{
			DRIVE_ROW_LOW();					  //return rows to driving low
			return(au8_keyTable[u8_row][u8_col]);
		}
	}
	DRIVE_ROW_LOW();							  //return rows to driving low
	return('E');								  //error
}
#endif
//******************************************************************************************//
//*************************************** keypad *******************************************//
//******************************************************************************************//
// DTMF tones are: 1->9, A->D, #, *, 0 (0->15)
ESOS_USER_TASK(keypad)
{
	static UINT data1;
	static UCHAR data2;

    ESOS_TASK_BEGIN();

    data2 = 0;
    data1 = 0;
   	silent_key = 0;

	while(TRUE)
	{
		ESOS_TASK_WAIT_TICKS(2);
		switch (e_isrState)
		{
			case STATE_WAIT_FOR_PRESS:
				if (KEY_PRESSED() && (u8_newKey == 0))
				{
	//ensure that key is sampled low for two consecutive interrupt periods
					e_isrState = STATE_WAIT_FOR_PRESS2;
				}
				break;
			case STATE_WAIT_FOR_PRESS2:
				if (KEY_PRESSED())
				{
	// a key is ready
					u8_newKey = doKeyScan();
					e_isrState = STATE_WAIT_FOR_RELEASE;
// send the message to FPGA to turn on DTMF tone
					if(silent_key == 0)
					{
						data1 = DTMF_TONE_ON;
						data1 <<= 8;
						data1 &= 0xFF00;
						data1 |= u8_newKey - 0xE0;
						__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data1);
					}


				} else e_isrState = STATE_WAIT_FOR_PRESS;
				break;

			case STATE_WAIT_FOR_RELEASE:
	//keypad released
				if (KEY_RELEASED())
				{
					ESOS_SIGNAL_SEMAPHORE(key_sem,1);
					e_isrState = STATE_WAIT_FOR_PRESS;
// send the message to FPGA to turn on DTMF tone

					if(silent_key == 0)
					{
						data1 = DTMF_TONE_OFF;
						data1 <<= 8;
						data1 &= 0xFF00;
						__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data1);
					}

				}
				break;
			default:
				e_isrState = STATE_WAIT_FOR_PRESS;
				break;
		}
	}
	ESOS_TASK_END();
}

//******************************************************************************************//
//************************************ key_timer_task **************************************//
//******************************************************************************************//
// dim the display after so many seconds of not getting a keypress
ESOS_USER_TASK(key_timer_task)
{
	static UINT data3;
	static ESOS_TASK_HANDLE comm1_handle;

    ESOS_TASK_BEGIN();
	comm1_handle = esos_GetTaskHandle(send_comm1);

    key_enter_time = 0;
	dim_screen = 0;
	engine_run_time = 0;
	engine_shutdown = 30;
	engine_shuttingdown = 0;
	while (TRUE)
	{
		ESOS_TASK_WAIT_TICKS(1000);

		if(engine_on == 1)
			engine_run_time++;
		else
		{
			engine_run_time = 0;
			if(lights_on > 0)
				lights_on--;
			if(lights_on == 0)
			{
				__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,OFF_LIGHTS);
				lights_on--;
			}
		}
/*
		avr_buffer[0] = EEPROM_STR;
		avr_buffer[1] = 1;	// row 1
		avr_buffer[2] = 0;	// col 0
		avr_buffer[3] = VARIOUS_MSG_OFFSET + 8;	//  engine run time msg
		avr_buffer[4] = 10;
		AVR_CALL();
*/
		if(key_mode == NORMAL)
		{
/*
			avr_buffer[0] = SEND_INT_RT_VALUES;
			avr_buffer[1] = 10;
			avr_buffer[2] = 33;
			avr_buffer[3] = (UCHAR)(engine_run_time >> 8);
			avr_buffer[4] = (UCHAR)engine_run_time;
			AVR_CALL();
*/
			avr_buffer[0] = DISPLAY_ELAPSED_TIME;
			avr_buffer[1] = rtlabel_str[RUN_TIME].row;
			avr_buffer[2] = rtlabel_str[RUN_TIME].data_col;
			avr_buffer[3] = (UCHAR)(engine_run_time >> 8);
			avr_buffer[4] = (UCHAR)engine_run_time;
			AVR_CALL();
		}

		if(engine_shutdown == 29)
		{
			data3 = SPECIAL_TONE_ON;
			data3 <<= 8;
			data3 &= 0xFF00;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_ON_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			key_enter_time = 0;
			key_mode = PASSWORD;
			password_valid = 0;
 			memset(password,0,PASSWORD_SIZE);
			password_ptr = 0;
			avr_buffer[0] = GOTO_CMD;
			avr_buffer[1] = 0;
			avr_buffer[2] = 7;
			AVR_CALL();
			avr_buffer[0] = PASSWORD_MODE;
//			avr_buffer[1] = (UCHAR)strlen(correct_password);
			avr_buffer[1] = 0;
			AVR_CALL();

			avr_buffer[0] = EEPROM_STR;
			avr_buffer[1] = 0;	// row 0
			avr_buffer[2] = 0;	// col 0
			avr_buffer[3] = VARIOUS_MSG_OFFSET + 6;	//  re-enter password
			avr_buffer[4] = 10;
			AVR_CALL();

			avr_buffer[0] = EEPROM_STR;
			avr_buffer[1] = 0;	// row 0
			avr_buffer[2] = 20;	// col 0
			avr_buffer[3] = VARIOUS_MSG_OFFSET + 7;	//  in x seconds
			avr_buffer[4] = 10;
			AVR_CALL();
		}
		if(engine_shutdown == 28)
		{
			data3 = DTMF_TONE_OFF;
			data3 <<= 8;
			data3 &= 0xFF00;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
		}
		if(engine_shutdown > 1 && engine_shutdown < 30)
		{
//			avr_buffer[0] = SEND_INT_RT_VALUES;
//			avr_buffer[0] = SEND_BYTE_RT_VALUES;
//			avr_buffer[1] = 0;
//			avr_buffer[2] = 23;
//			avr_buffer[3] = (UCHAR)engine_shutdown;
//			avr_buffer[4] = (UCHAR)(engine_shutdown);
//			AVR_CALL();
		}
		if(engine_shutdown == 5)
		{
			data3 = SPECIAL_TONE_ON;
			data3 <<= 8;
			data3 &= 0xFF00;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
		}
		if(engine_shutdown == 4)
		{
			data3 = DTMF_TONE_OFF;
			data3 <<= 8;
			data3 &= 0xFF00;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
		}
		if(engine_shutdown == 3)
		{
			data3 = SPECIAL_TONE_ON;
			data3 <<= 8;
			data3 &= 0xFF00;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
		}
		if(engine_shutdown == 2)
		{
			data3 = DTMF_TONE_OFF;
			data3 <<= 8;
			data3 &= 0xFF00;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
		}
		if(engine_shutdown == 1)
		{
			data3 = SPECIAL_TONE_ON;
			data3 <<= 8;
			data3 &= 0xFF00;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
		}

		if(engine_shutdown == 0)
		{
			data3 = DTMF_TONE_OFF;
			data3 <<= 8;
			data3 &= 0xFF00;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,SHUTDOWN);
			engine_shuttingdown = 0;
			engine_shutdown = 30;
			engine_on = 0;
			avr_buffer[0] = LCD_CLRSCR;
			avr_buffer[1] = 0;
			AVR_CALL();
			avr_buffer[0] = EEPROM_STR;
			avr_buffer[1] = 0;	// row 0
			avr_buffer[2] = 0;	// col 0
			avr_buffer[3] = VARIOUS_MSG_OFFSET + 9;
			avr_buffer[4] = 10;
			AVR_CALL();
		}
		if(engine_shuttingdown > 0)
			engine_shutdown--;
		else
		{
			engine_shutdown = 30;
/*
			avr_buffer[0] = GOTO_CMD;
			avr_buffer[1] = 0;
			avr_buffer[1] = 23;
			AVR_CALL();
			avr_buffer[0] = CHAR_CMD;
			avr_buffer[1] = 0x20;
			AVR_CALL();
			avr_buffer[0] = CHAR_CMD;
			avr_buffer[1] = 0x20;
			AVR_CALL();
*/
		}
		if(key_enter_time == 200)	// 3 1/3 minutes
		{
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_80DC_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			dim_screen++;
		}
		if(key_enter_time == 400)	// 6 2/3 minutes
		{
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_75DC_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			dim_screen++;
		}
		if(key_enter_time == 800)	// 13 1/3 minutes
		{
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_50DC_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			dim_screen++;
		}
		if(key_enter_time == 1600)	// ~26 minutes
		{
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_25DC_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			dim_screen++;
		}
		if(key_enter_time == 3200)	// ~52 minutes
		{
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_12DC_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			dim_screen++;
		}
		if(key_enter_time == 6400)	// ~1 hour & 46 minutes
		{
			data3 = LCD_PWM;
			data3 <<= 8;
			data3 &= 0xFF00;
			data3 |= PWM_OFF_PARAM;
			__esos_CB_WriteUINT16(fpga_handle->pst_Mailbox->pst_CBuffer,data3);
			dim_screen++;
		}
		key_enter_time++;
	}
    ESOS_TASK_END();
}
//******************************************************************************************//
//*********************************** temp_monitor_task ************************************//
//******************************************************************************************//
ESOS_USER_TASK(temp_monitor_task)
{
	static ESOS_TASK_HANDLE comm1_handle;
	static int fan_ok;		// heater fan ok to run if engine temp high enough
	static int lfan_on;
	static int lengine_fan;

    ESOS_TASK_BEGIN();
	comm1_handle = esos_GetTaskHandle(send_comm1);

	lfan_on = 0;
	lengine_fan = 0;

	// init global vars which are later set by SET_PARAMS msg from TS-7200
	// engine temps
	gl_blower_en = 100;		// enable blower only if engine temp > 100F
	gl_fan_on = 150;		// turn engine cooling fan on if engine temp > 150F
	gl_fan_off = 60;		// turn engine cooling fan off if engine temp < 60F
	// indoor air temps
	gl_blower1_on = 60;		// turn blower1 on if indoor temp > 60F
	gl_blower2_on = 50;		// turn blower1 on if indoor temp > 50F
	gl_blower3_on = 40;		// turn blower1 on if indoor temp > 40F

	while (TRUE)
	{
		ESOS_TASK_WAIT_TICKS(1000);
		// turn cooling fan on if temp > gl_fan_on
		if(gl_engine_temp > gl_fan_on)
//		if(gl_engine_temp > 48) 	// for testing (using space heater)
		{
			// turn fan on
			if(lengine_fan == 0)
			{
				__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,ON_FAN);
				lengine_fan = 1;
			}
		}

		// turn cooling fan off if temp < gl_fan_off
		if(gl_engine_temp < gl_fan_off)
		{
		// turn fan off
			if(fan_on == 0)
			{
				if(lengine_fan == 1)
				{
					__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,OFF_FAN);
					lengine_fan = 0;
				}
			}
		}
		
// gl_blower3_on is the temp at which the blower 3 goes on i.e. the lowest temp
// gl_blower2_on is the middle temperature where the blower runs at medium speed
// gl_blower1_on sets the blower to the lowest speed where the indoor temp is almost
// warm enough - then if the indoor temp goes above the gl_blower1_on temp, it shuts off

		if(blower_on == 0)
		{
			// if engine temp > gl_blower_on then we can mess with the blower fan
			if(gl_engine_temp > gl_blower_en)
			{
				if(gl_indoor_temp > gl_blower1_on)
				{
					if(lfan_on != 0)
					{
						__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,BLOWER_OFF);
						lfan_on = 0;
					}
				}

				if(gl_indoor_temp > gl_blower2_on && gl_indoor_temp < gl_blower1_on)
				{
					if(lfan_on != 1)
					{
						__esos_CB_WriteUINT8(comm1_handle->pst_Mailbox->pst_CBuffer,BLOWER1);
						lfan_on = 1;
					}
				}
		
